[
  {
    "id": "2c72f2cb-2907-49e7-8c27-b2cbb1da9e78",
    "timestamp": 1754079130489,
    "tipoConsulta": "buscar",
    "consulta": {
      "edad": 20,
      "sexo": "Femenino",
      "peso": 30,
      "sintomas": "Anorexia",
      "antecedentes": ""
    },
    "resultado": {
      "resultados": [
        {
          "id": 94,
          "diagnostico": "Cáncer de próstata localizado",
          "motivo_consulta": "Disuria, nicturia y goteo terminal",
          "historia_actual": "Hombre de 68 años, síntomas urinarios progresivos, PSA elevado",
          "antecedentes": "Padre con CA próstata",
          "edad": "68",
          "peso": "78",
          "examen_fisico": "Próstata aumentada, nódulo duro",
          "evolucion": "Confirmado por biopsia, cirugía planificada",
          "tratamiento": "Prostatectomía, vigilancia",
          "especialidad_1": "Urología",
          "especialidad_2": "Oncología"
        },
        {
          "id": 55,
          "diagnostico": "Insuficiencia renal crónica estadio 4",
          "motivo_consulta": "Fatiga, edemas y disminución de la diuresis",
          "historia_actual": "Hombre de 60 años, hipertenso de larga data, consulta por fatiga, hinchazón en piernas y reducción de orina",
          "antecedentes": "HTA, diabetes tipo 2",
          "edad": "60",
          "peso": "76",
          "examen_fisico": "PA: 150/92 mmHg, edemas, piel seca",
          "evolucion": "Inicia manejo conservador, plan para hemodiálisis",
          "tratamiento": "Restricción proteica, furosemida, eritropoyetina",
          "especialidad_1": "Nefrología",
          "especialidad_2": "Medicina Interna"
        },
        {
          "id": 81,
          "diagnostico": "Gripe AH1N1 con complicación",
          "motivo_consulta": "Fiebre alta, mialgias y disnea",
          "historia_actual": "Adolescente de 13 años, fiebre 39.5°C, dolores musculares, tos seca, dificultad para respirar",
          "antecedentes": "Vacunación incompleta",
          "edad": "13",
          "peso": "41",
          "examen_fisico": "Crepitantes pulmonares, SatO2: 91%",
          "evolucion": "Buena evolución con antivirales",
          "tratamiento": "Oseltamivir, antipiréticos",
          "especialidad_1": "Infectología",
          "especialidad_2": "Pediatría"
        },
        {
          "id": 83,
          "diagnostico": "Anemia ferropénica",
          "motivo_consulta": "Fatiga, palidez y caída de cabello",
          "historia_actual": "Mujer de 29 años, menstruaciones abundantes, cansancio progresivo",
          "antecedentes": "Sin antecedentes, dieta vegetariana",
          "edad": "29",
          "peso": "62",
          "examen_fisico": "Palidez mucocutánea, uñas frágiles",
          "evolucion": "Mejoría tras suplementación",
          "tratamiento": "Hierro oral, dieta rica en hierro",
          "especialidad_1": "Medicina Interna",
          "especialidad_2": "Ginecología"
        },
        {
          "id": 101,
          "diagnostico": "Endocarditis infecciosa",
          "motivo_consulta": "Fiebre, soplo y petequias",
          "historia_actual": "Hombre de 35 años, adicto IV, fiebre alta, soplo nuevo, hemocultivo positivo",
          "antecedentes": "Uso de drogas IV",
          "edad": "35",
          "peso": "68",
          "examen_fisico": "Soplo sistólico, petequias, fiebre",
          "evolucion": "Tratamiento prolongado, mejoría parcial",
          "tratamiento": "Vancomicina, gentamicina",
          "especialidad_1": "Cardiología",
          "especialidad_2": "Infectología"
        }
      ]
    }
  },
  {
    "id": "79510f57-0aba-45e7-af14-e744bf51eb58",
    "timestamp": 1754080676623,
    "tipoConsulta": "diagnostico_imagen",
    "consulta": {
      "imagenes": [
        "imagen_3.jpeg",
        "imagen_2.jpeg",
        "imagen_1.jpeg"
      ]
    },
    "resultado": {
      "resultados": [
        {
          "imagen": "imagen_3.jpeg",
          "descripcion": {
            "hallazgos_principales": "Presencia de una lesión quística de aproximadamente 4 cm de diámetro en el riñón derecho, con bordes mal definidos. Presencia de líquido libre en la cavidad abdominal.",
            "diagnostico_probable": "Posible quiste renal derecho con posible fuga de líquido. Considerar la posibilidad de una lesión renal maligna, aunque la descripción de la lesión quística sugiere un proceso benigno. Se requiere una evaluación adicional para descartar otras causas de líquido libre en la cavidad abdominal."
          }
        },
        {
          "imagen": "imagen_2.jpeg",
          "descripcion": {
            "hallazgos_principales": "Lesión quística de aproximadamente 3.5 cm en el riñón izquierdo, con bordes mal definidos. El hígado y los órganos adyacentes parecen normales.",
            "diagnostico_probable": "Lesión quística en el riñón izquierdo. Se recomienda seguimiento con ecografía para evaluar su crecimiento y características."
          }
        },
        {
          "imagen": "imagen_1.jpeg",
          "descripcion": {
            "hallazgos_principales": "Presencia de una lesión de densidad heterogénea en el cuadrante inferior izquierdo del abdomen, de aproximadamente 6 cm de diámetro. Se observa una masa de baja densidad con áreas de necrosis. Se evidencia una hernia inguinal izquierda con contenido mesentérico.",
            "diagnostico_probable": "Tumor maligno (posible cáncer de colon) con metástasis, con hernia inguinal izquierda."
          }
        }
      ],
      "hallazgo_final": "Se identifican dos lesiones quísticas en los riñones, una en el riñón derecho y otra en el riñón izquierdo. Además, se observa una lesión de densidad heterogénea en el cuadrante inferior izquierdo del abdomen con características sugestivas de un tumor maligno, posiblemente de origen colónico, con metástasis y hernia inguinal izquierda.",
      "diagnostico_global": "Se sospecha la presencia de un tumor maligno (posible cáncer de colon) con metástasis en el cuadrante inferior izquierdo del abdomen, asociado a una hernia inguinal izquierda. Se requiere una evaluación adicional, incluyendo estudios de imagen más detallados y posiblemente biopsia, para confirmar el diagnóstico y determinar la extensión de la enfermedad.",
      "diagnostico_global_raw": "user\nSe han analizado varias imágenes médicas, cada una con su informe individual:\nInforme de la imagen 1:\nHallazgos principales: Presencia de una lesión quística de aproximadamente 4 cm de diámetro en el riñón derecho, con bordes mal definidos. Presencia de líquido libre en la cavidad abdominal.\n\nDiagnóstico probable: Posible quiste renal derecho con posible fuga de líquido. Considerar la posibilidad de una lesión renal maligna, aunque la descripción de la lesión quística sugiere un proceso benigno. Se requiere una evaluación adicional para descartar otras causas de líquido libre en la cavidad abdominal.\n\n\nInforme de la imagen 2:\nHallazgos principales: Lesión quística de aproximadamente 3.5 cm en el riñón izquierdo, con bordes mal definidos. El hígado y los órganos adyacentes parecen normales.\n\nDiagnóstico probable: Lesión quística en el riñón izquierdo. Se recomienda seguimiento con ecografía para evaluar su crecimiento y características.\n\n\nInforme de la imagen 3:\nHallazgos principales: Presencia de una lesión de densidad heterogénea en el cuadrante inferior izquierdo del abdomen, de aproximadamente 6 cm de diámetro. Se observa una masa de baja densidad con áreas de necrosis. Se evidencia una hernia inguinal izquierda con contenido mesentérico.\n\nDiagnóstico probable: Tumor maligno (posible cáncer de colon) con metástasis, con hernia inguinal izquierda.\n\n\nComo radiólogo clínico experto, integra todos los hallazgos y redacta un único informe resumen. Responde exactamente así (NO repitas el formato):\nHallazgo final: [Resumen de los hallazgos de todas las imágenes]\nDiagnóstico global: [Diagnóstico integrador, justifica brevemente la hipótesis y posibles diagnósticos diferenciales]\n\n\nHallazgo final: Se identifican dos lesiones quísticas en los riñones, una en el riñón derecho y otra en el riñón izquierdo. Además, se observa una lesión de densidad heterogénea en el cuadrante inferior izquierdo del abdomen con características sugestivas de un tumor maligno, posiblemente de origen colónico, con metástasis y hernia inguinal izquierda.\n\nDiagnóstico global: Se sospecha la presencia de un tumor maligno (posible cáncer de colon) con metástasis en el cuadrante inferior izquierdo del abdomen, asociado a una hernia inguinal izquierda. Se requiere una evaluación adicional, incluyendo estudios de imagen más detallados y posiblemente biopsia, para confirmar el diagnóstico y determinar la extensión de la enfermedad.\n"
    }
  }
]